lib/PanoptoFunctions/AccessManagement/GetSelfUserAccessDetails.hbs

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/" xmlns:pan="http://schemas.datacontract.org/2004/07/Panopto.Server.Services.PublicAPI.V40">
   <soapenv:Header/>
   <soapenv:Body>
      <tem:GetSelfUserAccessDetails>
         <tem:auth>
            {{#if auth.AuthCode}}
            <pan:AuthCode>{{auth.AuthCode}}</pan:AuthCode>
            {{/if}}
            {{#if auth.Password}}
            <pan:Password>{{auth.Password}}</pan:Password>
            {{/if}}
            {{#if auth.UserKey}}
            <pan:UserKey>{{auth.UserKey}}</pan:UserKey>
            {{/if}}
         </tem:auth>
      </tem:GetSelfUserAccessDetails>
   </soapenv:Body>
</soapenv:Envelope>

